FVM/Non-Newtonian/3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0001;

vertices
(
    (0 0 0)
    (5 0 0)
    (5 1 0)
    (0 1 0)
    (0 0 1)
    (5 0 1)
    (5 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 100 100) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type patch;
        faces
        (
                (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    down
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    up
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    front
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
